'''
Python Mini Project Ασκηση 2.1
'''

import math
import time

Δ = 0

#Η εισαγωγή των τιμών των σαθερών του τριωνύμου

α = float(input('Δώσε την τιμή της σταθεράς α του τριωνύμου αx**2+ βx + γ:\n'))
β = float(input('Δώσε την τιμή της σταθεράς β του τριωνύμου αx**2+ βx + γ:\n'))
γ = float(input('Δώσε την τιμή της σταθεράς γ του τριωνύμου αx**2+ βx + γ:\n'))


#Εισαγωγη μηδεν σε α, β

if α==0:
    if β!=0:
        χ1 = -γ / β
        print("Το α ειναι 0 αρα ειναι δυωνυμο. Παρόλα αυτα η λυση είναι:", χ1)
    else:
        print("Δεν νομιζω οτι ψαχνεις κατι τελικα.")		
#Υπολογισμός της διακρίνουσας
else:
    Δ = β**2 - 4*α*γ

    if Δ<0:
        print("Το τριώνυμο δεν εχει λύσεις")
    elif Δ==0:
        χ1= -β/(2*α)
        print("Το τριώνυμο εχει μια διπλή ριζα την:", χ1)
    else:
        χ1= (-β + math.sqrt(Δ))/(2*α)
        χ2= (-β - math.sqrt(Δ))/(2*α)
        print("Το τριωνυμο έχει δυο λύσεις την", χ1,"και την",χ2)

time.sleep(5)
